---
kind: method
id: M:Autodesk.Revit.DB.DocumentDifference.GetDeletedElementIds
source: html/295b832e-a844-9a39-e746-ef072eb964be.htm
---
# Autodesk.Revit.DB.DocumentDifference.GetDeletedElementIds Method

Deleted element id collection.
 For non-worksharing models, this will always be an empty collection.

## Syntax (C#)
```csharp
public ISet<ElementId> GetDeletedElementIds()
```